In [1]:
import pandas as pd

In [63]:
data = {
    '이름' : ['홍길동', '임꺽정', '이순신'],
    '중간' : [40,60,100],
    '기말' : [60,50,95],
    '출석' : [8.5, 7.8,9.9]
}

In [64]:
df = pd.DataFrame(data)

In [65]:
df

    이름   중간  기말   출석
0  홍길동   40  60  8.5
1  임꺽정   60  50  7.8
2  이순신  100  95  9.9

In [66]:
df.shape

(3, 4)

In [67]:
df.index #행 인덱스

RangeIndex(start=0, stop=3, step=1)

In [68]:
list(df.index)

[0, 1, 2]

In [69]:
df.columns

Index(['이름', '중간', '기말', '출석'], dtype='object')

In [70]:
list(df.columns)

['이름', '중간', '기말', '출석']

In [71]:
df.columns[0]

'이름'

In [72]:
df.columns = ['name','mid','final','attd']

In [73]:
df

  name  mid  final  attd
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8
2  이순신  100     95   9.9

In [74]:
df.describe() #몇개, 평균, 표준편차, 최솟값, 25,50,75, 최댓값

              mid      final      attd
count    3.000000   3.000000  3.000000
mean    66.666667  68.333333  8.733333
std     30.550505  23.629078  1.069268
min     40.000000  50.000000  7.800000
25%     50.000000  55.000000  8.150000
50%     60.000000  60.000000  8.500000
75%     80.000000  77.500000  9.200000
max    100.000000  95.000000  9.900000

In [75]:
df.T

         0    1    2
name   홍길동  임꺽정  이순신
mid     40   60  100
final   60   50   95
attd   8.5  7.8  9.9

### 정렬
인덱스를 정렬-> sort_index  
값을 정렬-> sort_values

In [76]:
df.sort_index()

  name  mid  final  attd
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8
2  이순신  100     95   9.9

In [77]:
df.sort_index(ascending=False)

  name  mid  final  attd
2  이순신  100     95   9.9
1  임꺽정   60     50   7.8
0  홍길동   40     60   8.5

In [78]:
df

  name  mid  final  attd
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8
2  이순신  100     95   9.9

In [79]:
df.sort_index(axis = 1)

   attd  final  mid name
0   8.5     60   40  홍길동
1   7.8     50   60  임꺽정
2   9.9     95  100  이순신

In [80]:
df.sort_index(axis = 1, ascending=False)

  name  mid  final  attd
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8
2  이순신  100     95   9.9

In [81]:
df.sort_values(by = 'final')

  name  mid  final  attd
1  임꺽정   60     50   7.8
0  홍길동   40     60   8.5
2  이순신  100     95   9.9

In [82]:
df.sort_values(by = 'final', ascending = False)

  name  mid  final  attd
2  이순신  100     95   9.9
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8

In [83]:
df['name']

0    홍길동
1    임꺽정
2    이순신
Name: name, dtype: object

In [84]:
type(df['final'])

pandas.core.series.Series

In [85]:
df

  name  mid  final  attd
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8
2  이순신  100     95   9.9

In [86]:
df[1:2]

  name  mid  final  attd
1  임꺽정   60     50   7.8

In [87]:
df['mid':'final']

TypeError: cannot do slice indexing on RangeIndex with these indexers [mid] of type str

In [89]:
df

  name  mid  final  attd
0  홍길동   40     60   8.5
1  임꺽정   60     50   7.8
2  이순신  100     95   9.9

In [90]:
df['주소'] = '경산'

In [91]:
df

  name  mid  final  attd  주소
0  홍길동   40     60   8.5  경산
1  임꺽정   60     50   7.8  경산
2  이순신  100     95   9.9  경산

In [92]:
df['생일'] = ['1999-01-02', '2010-09-17', '2015-01-18']

In [93]:
df

  name  mid  final  attd  주소          생일
0  홍길동   40     60   8.5  경산  1999-01-02
1  임꺽정   60     50   7.8  경산  2010-09-17
2  이순신  100     95   9.9  경산  2015-01-18

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   mid     3 non-null      int64
 2   final   3 non-null      int64
 3   attd    3 non-null      float64
 4   주소      3 non-null      object
 5   생일      3 non-null      object
dtypes: float64(1), int64(2), object(3)
memory usage: 272.0+ bytes

In [95]:
df.index = ['하나', '둘','셋']

In [96]:
df

   name  mid  final  attd  주소          생일
하나  홍길동   40     60   8.5  경산  1999-01-02
둘   임꺽정   60     50   7.8  경산  2010-09-17
셋   이순신  100     95   9.9  경산  2015-01-18

In [97]:
df.set_index(['생일'])

           name  mid  final  attd  주소
생일
1999-01-02  홍길동   40     60   8.5  경산
2010-09-17  임꺽정   60     50   7.8  경산
2015-01-18  이순신  100     95   9.9  경산

In [98]:
df

   name  mid  final  attd  주소          생일
하나  홍길동   40     60   8.5  경산  1999-01-02
둘   임꺽정   60     50   7.8  경산  2010-09-17
셋   이순신  100     95   9.9  경산  2015-01-18

In [99]:
df.index = ['1', '2','3']

In [100]:
df

  name  mid  final  attd  주소          생일
1  홍길동   40     60   8.5  경산  1999-01-02
2  임꺽정   60     50   7.8  경산  2010-09-17
3  이순신  100     95   9.9  경산  2015-01-18

In [101]:
df2 = df.set_index(['생일'])

In [102]:
df2

           name  mid  final  attd  주소
생일
1999-01-02  홍길동   40     60   8.5  경산
2010-09-17  임꺽정   60     50   7.8  경산
2015-01-18  이순신  100     95   9.9  경산

In [103]:
df

  name  mid  final  attd  주소          생일
1  홍길동   40     60   8.5  경산  1999-01-02
2  임꺽정   60     50   7.8  경산  2010-09-17
3  이순신  100     95   9.9  경산  2015-01-18

In [104]:
df['mid']['2']

60

In [105]:
df['mid']

1     40
2     60
3    100
Name: mid, dtype: int64

In [106]:
df['mid'][1]

60

In [107]:
df['합'] = (df['mid']*3+df['final']*5+df['attd']*20)/10

In [108]:
df

  name  mid  final  attd  주소          생일     합
1  홍길동   40     60   8.5  경산  1999-01-02  59.0
2  임꺽정   60     50   7.8  경산  2010-09-17  58.6
3  이순신  100     95   9.9  경산  2015-01-18  97.3

In [109]:
df.sort_values(by = '합', ascending = False)

  name  mid  final  attd  주소          생일     합
3  이순신  100     95   9.9  경산  2015-01-18  97.3
1  홍길동   40     60   8.5  경산  1999-01-02  59.0
2  임꺽정   60     50   7.8  경산  2010-09-17  58.6

In [110]:
df1 = df.sort_values(by = '합', ascending = False)

In [111]:
df1['성적'] = ['A', 'B', 'C']

In [112]:
df1

  name  mid  final  attd  주소          생일     합 성적
3  이순신  100     95   9.9  경산  2015-01-18  97.3  A
1  홍길동   40     60   8.5  경산  1999-01-02  59.0  B
2  임꺽정   60     50   7.8  경산  2010-09-17  58.6  C

In [113]:
df = df1.sort_index()

In [114]:
df

  name  mid  final  attd  주소          생일     합 성적
1  홍길동   40     60   8.5  경산  1999-01-02  59.0  B
2  임꺽정   60     50   7.8  경산  2010-09-17  58.6  C
3  이순신  100     95   9.9  경산  2015-01-18  97.3  A